Highcharts.chart('container', {
	chart: {
		type: 'boxplot'
	},
	title: {
		text: 'Highcharts box plot styling'
	},
	legend: {
		enabled: true
	},
	xAxis: {
		categories: ['器官1', '器官2', '器官3', '器官4', '器官5', '器官6', '器官7', '器官8'],
		// title: {
		// 	text: 'Experiment No.'
		// }
	},
	yAxis: {
		title: {
			text: 'DSC'
		}
	},
	plotOptions: {
		boxplot: {
			fillColor: '#F0F0E0',
			lineWidth: 2,
			medianColor: '#0C5DA5',
			medianWidth: 3,
			stemColor: '#A63400',
			stemDashStyle: 'dot',
			stemWidth: 1,
			whiskerColor: '#3D9200',
			whiskerLength: '20%',
			whiskerWidth: 3
		}
	},
	series: [
	    // 每个字典对象是一个 baseline，data 属性里是每个数组对应一个器官的 DSC 值的 box 分布
	    {
		name: 'baseline1',
		data: [
			[760, 801, 848, 895, 965],
			[733, 853, 939, 980, 1080],
			[760, 801, 848, 895, 965],
			[733, 853, 939, 980, 1080],
			[760, 801, 848, 895, 965],
			[733, 853, 939, 980, 1080],
			[760, 801, 848, 895, 965],
			[733, 853, 939, 980, 1080],
		]
	}, {
         name: "baseline2",
         data: [
             [724, 802, 806, 871, 950],
             [834, 836, 864, 882, 910],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
         ]
    }, {
         name: "baseline3",
         data: [
             [724, 802, 806, 871, 950],
             [834, 836, 864, 882, 910],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
         ]
    }, {
         name: "baseline4",
         data: [
             [714, 762, 817, 870, 918],
             [834, 836, 864, 882, 910],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
             [760, 801, 848, 895, 965],
             [733, 853, 939, 980, 1080],
         ]
	}]
});
